In [5]:
import pandas as pd

In [6]:
series = pd.Series(["BMW" , "TOYOTA" , "HONDA"])
series

0       BMW
1    TOYOTA
2     HONDA
dtype: object

In [8]:
colours = pd.Series(["red","blue","green"])
colours

0      red
1     blue
2    green
dtype: object

In [10]:
car_data = pd.DataFrame({"car make": series, "colours":colours})
car_data

  car make colours
0      BMW     red
1   TOYOTA    blue
2    HONDA   green

In [11]:
car_sales =pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
# exporting a dataframe 

car_sales.to_csv("export-carsales.csv") , index = False

In [14]:
export_carsales = pd.read_csv("export-carsales.csv")
export_carsales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

DESCRIBE DATA

In [7]:
# attribute 

car_sales.dtypes

#function 

# car_sales.to_vsv()

NameError: name 'car_sales' is not defined